/* 
  Localizable.strings
  Visla

  Created by Porter Liu on 8/6/20.
  Copyright © 2020 Visla. All rights reserved.
*/

"home" = "Home";
"capture" = "Capture";
"projects" = "Projects";
"contacts" = "Contacts";
"settings" = "Settings";

// First view
"sign up" = "Sign up";
"sign in" = "Sign in";

// Sign In
"email address" = "Email Address";
"password" = "Password";
"forgot password" = "Forgot password?";
"sign in with google" = "Sign In With Google";
"sign in with apple" = "Sign In With Apple";
"sign out apple" = "Sign Out Apple";
"sign out google" = "Sign Out Google";
"Sign in with social media" = "Sign in with social media";
"or log with email address" = "or log with email address";

"Don't have an account?" = "Don't have an account?";

// Home
"my feeds" = "My Feeds";
"my library" = "My Library";
"recent" = "Recent";
"starred" = "Starred";
"shared with me" = "Shared with Me";
"trash" = "Trash";
"spam" = "Spam";
"my clips" = "My Clips";

"create folder" = "Create Folder";
"rename folder" = "Rename Folder";
"are you sure to delete?" = "Are you sure to delete?";
"Are you sure to spam?" = "Are you sure to spam?";
"upload" = "Upload";
"choose a media file to upload" = "Choose a media file to upload";
"choose a path to download" = "Choose a path to download";
"star" = "Star";
"unstar" = "Unstar";
"share" = "Share";
"delete" = "Delete";
"rename" = "Rename";
"report spam" = "Report Spam";
"ok" = "OK";
"cancel" = "Cancel";
"cancel all uploads" = "Cancel All Uploads";
"uploading %d item" = "Uploading %d item";
"uploading %d items" = "Uploading %d items";
"%d minutes remaining" = "%d minutes remaining";
"%d minute remaining" = "%d minute remaining";
"%d second remaining" = "%d second remaining";
"%d seconds remaining" = "%d seconds remaining";
"%d viewer" = "%d viewer";
"%d viewers" = "%d viewers";
"%@ created at %@ • %@" = "%@ created at %@ • %@";

"Are you sure to cancel all uploading items?" = "Are you sure to cancel all uploading items?";
"Upload Complete" = "Upload Complete";
"Upload Failed" = "Upload Failed";

"invite people and group" = "Invite People and Group";
"Add Message" = "Add Message";
"Viewer" = "Viewer";
"Contributor" = "Contributor";
"Manager" = "Manager";
"Shared with %d people" = "Shared with %d people";
"Share" = "Share";
"Save" = "Save";
"Email is not a valid email" = "Email is not a valid email";
"Notify Via Email" = "Notify Via Email";
"Role Permissions" = "Role Permissions";
"Folder Owner" = "Folder Owner";
"Folder Manager" = "Folder Manager";
"Viewer: Can view and comment on clip" = "Viewer: Can view and comment on clip";
"Manager: Can manage comments and change sharing settings of clip (Sign-in required)" = "Manager: Can manage comments and change sharing settings of clip (Sign-in required)";
"Viewer: Can view folder content" = "Viewer: Can view folder content";
"Contributor: Can add and manage own content (Sign in required)" = "Contributor: Can add and manage own content (Sign in required)";
"Manager: Can manage and moderate content, and change sharing settings of folder (Sign in required)" = "Manager: Can manage and moderate content, and change sharing settings of folder (Sign in required)";
"Copy link" = "Copy link";
"Add Tags(Separated by commas, Not visible to other clip viewers)" = "Add Tags(Separated by commas, Not visible to other clip viewers)";
"Please press “,” or “Enter” to add more details and send invite." = "Please press “,” or “Enter” to add more details and send invite.";
"Allow anoymous comments" = "Allow anoymous comments";
"Allow Comments" = "Allow Comments";
"Allow anonymous comments\n(Unauthenticated/non-logged in users)" = "Allow anonymous comments\n(Unauthenticated/non-logged in users)";
"Allow Comments on Clips" = "Allow Comments on Clips";
"Only Owner & Manager can see comments" = "Only Owner & Manager can see comments";
"Allow Downloads" = "Allow Downloads";
"Show Expiration Time" = "Show Expiration Time";
"Video expires by end of the day." = "Video expires by end of the day.";
"moderate videos\n(all clips must be reviewed and activated by owner/co-owner)" = "Moderate Videos\n(All clips must be reviewed and activated by owner/co-owner)";
"moderate videos\n(all projects must be reviewed and activated by owner/co-owner)" = "Moderate Videos\n(All projects must be reviewed and activated by owner/co-owner)";
"copy succeed!" = "copy succeed!";
"%d item" = "%d item";
"%d items" = "%d items";
"Restore" = "Restore";
"Delete Permanently" = "Delete Permanently";
"Move to Folder" = "Move to Folder";
"Duplicate" = "Duplicate";
"Duplicate success" = "Duplicate success";
"Delete success" = "Delete success";
"Clip Rename" = "Clip Rename";
"Remove from Starred" = "Remove from Starred";
"Move" = "Move";
"Download" = "Download";
"The folder is empty~" = "The folder is empty~";
"Untitled folder" = "Untitled folder";
"Create a new folder in My Library" = "Create a new folder in My Library";
"sort by" = "Sort By";
"Add Description" = "Add Description";
"Merge" = "Merge";
"%d Selected" = "%d Selected";
"unselect all" = "Unselect All";
"Empty Trash" = "Empty Trash";
"Visla Library" = "Visla Library";
"Merged Video" = "Merged Video";
"drag to reposition video order." = "Drag to reposition video order.";

"Post" = "Post";
"Reply" = "Reply";
"Comments(%d)" = "Comments(%d)";
"Comments" = "Comments";
"Type your comment" = "Type your comment";
"Type your reply" = "Type your reply";
"Transcription" = "Transcription";
"Only show comment to owner & manager (if any)" = "Only show comment to owner & manager (if any)";
"Anonymous" = "Anonymous";
"(Only to Clip Owner & Manager)" = "(Only to Clip Owner & Manager)";

"Show All" = "View All %d Comments";
"Hide All" = "Hide All %d Comments";
"Show More" = "Show More Comments";
"Disable Comments" = "The comment section has been disabled. We are showing comments made previous to the change.";
"Disable Comments Session" = "The comment section has been disabled.";
"Comments Limit Hint" = "Your comments will only be seen by the clip owner & manager.";

"oldest" = "Oldest";
"most recent" = "Most Recent";
"name" = "Name";

"%d views" = "%d Views";
"%d comments" = "%d Comments";
"remove from spam" = "Remove from Spam";
"owner" = "Owner";
"are you sure to delete comment" = "Are you sure you want to delete this comment?";
"delete permanently" = "Delete Permanently";
"delete clip permanently" = "Delete clip permanently?";
"cannot restore it" = "You will not be able to restore it.";

// move hint
"different org with folder" = "This clip's org sharing permissions will be adjusted according to the folder's org sharing.";
"clip access hint" = "This clip and its associated comments will be visible to everyone who has access to (%@).";
"change access" = "Change who can access?";
"move successful" = "Clips have been moved successfully";

// share hint
"view" = "view";
"manage" = "manage";
"contribute" = "contribute";
"anyone with link" = "Anyone with link";
"anyone within [%@]" = "Anyone within [%@]";
"anyone within [%@] can %@" = "Anyone within [%@] can %@";
"anyone with link can %@" = "Anyone with link can %@";
"restricted access - only those invited can access" = "Restricted access - only those invited can access";
"only those invited can access." = "Only those invited can access.";
"anyone with link can access." = "Anyone with link can access.";
"anyone within [%@] can access." = "Anyone within [%@] can access.";
"anyone on the internet with link can view." = "Anyone on the internet with link can view.";

// contacts
"back" = "Back";
"add new contact" = "Add New Contact";
"add new group" = "Add New Group";
"all clips shared by %@" = "All Clips Shared by %@";
"my friends" = "My Friends";
"other contacts" = "Other Contacts";

// moderation
"pending" = "Pending";
"reject" = "Reject";
"approve" = "Approve";
"moderation" = "Moderation";
"moderate asset:" = "Moderate asset:";

// record
"record new clip" = "Record New Clip";
"start group recording" = "Start Group Recording";
"select mic" = "Select Mic";
"select camera(s)" = "Select Camera(s)";
"select speaker" = "Select Speaker";
"add screen" = "Add Screen";
"default device" = "Default Device";
"type your speaker notes" = "Type your speaker notes here...";
"add image" = "Add Image";
"add screen" = "Add Screen";
"add music" = "Add Music";
"start recording" = "Start Recording";
"%@ 's settings" = "%@ 's Settings";
"action" = "Action";
"cut" = "Cut";
"monitor" = "Monitor";
"clips" = "Clips";
"take %d" = "Take %d";
"me" = "Me";
"join as director" = "Join As Director";
"assign new director" = "Assign New Director";
"leave recording" = "Leave Recording";
"leave by myself" = "Leave by Myself";
"end for all" = "End Recording For All";
"assign" = "Assign";
"push talk" = "Push to Talk to Recording Group";
"stop pushing" = "Stop Pushing to Talk";
"recording" = "Recording";
"show camera view" = "Show Own Camera View";
"hide camera view" = "Disable Own Camera View";
"config settings" = "Configure Settings";
"add via QR code" = "Add via QR Code";
"save changes" = "Save Changes";
"title" = "Title";
"category" = "Category";
"description" = "Description";
"tags" = "Tags";
"change main story order" = "Change Main Story Order";
"edit transcript" = "Edit Transcript";

// Capture
"video capture" = "Video Capture";
"screen capture" = "Screen Capture";
"take a photo" = "Take a Photo";

// error
"unexpected error (%d)" = "unexpected error (%d)";
"0" = "succeed";
"1000" = "Unknown error";
"2000" = "Action not allowed based on permission";
"3000" = "Illegal request parameters";
"3001" = "Illegal request path";
"3002" = "Illegal request";
"3003" = "Missing required parameters";
"3004" = "Missing token";
"3005" = "Invalid token";
"3006" = "Invalid email format";
"3007" = "Illegal sort parameters";
"4000" = "User does not exist";
"4001" = "Clip does not exist";
"4002" = "Folder does not exist";
"4003" = "Comment is not found";
"4004" = "Project is not found";
"4005" = "The project recording is not found";
"4006" = "The attendee is not in the project recording";
"4007" = "The recording is not in the project";
"4008" = "The recording has not started";
"4009" = "Project asset is not found";
"4010" = "The recording has ended";
"4011" = "The project category is not found";
"4012" = "Contact is not found";
"4013" = "Contact group is not found";
"4014" = "The project sequence is not found";
"4015" = "Comment is not found";
"4016" = "A-roll is not found";
"4017" = "B-roll is not found";
"5000" = "The e-mail address has already been bound";
"5001" = "The e-mail address has already been activated";
"5002" = "This folder name already exists";
"5003" = "This group name already exists";
"5004" = "This project name already exists";
"5005" = "Failed to create project";
"5006" = "This asset already exists in this project";
"5007" = "AI engine is already working on this project";
"5008" = "This e-mail address has already been added as a contact";
"5009" = "You are already the owner";
"6000" = "This account has been compromised";
"6001" = "Your account has not been activated. Please check the activation email in your box.";
"6002" = "Access denied";
"6003" = "This e-mail address is not on the whitelist";
"6004" = "Action denied";
"6005" = "This IP address is not on the whitelist";
"6006" = "Comment section is disabled";
"6007" = "Comments are not visible";
"7000" = "Email or password is wrong";
"7001" = "This account was previously linked to Google. Please sign in with Google";
"7002" = "This account was previously linked to Apple. Please sign in with Apple";
"8000" = "This folder has been deleted";
"8002" = "This clip has been deleted";
"8003" = "This contact has been deleted";
"8004" = "This contact group has been deleted";
"8005" = "This clip is under moderation";
"9000" = "Unsupported file format";
"14000" = "Internal server error";
"15001" = "The Asset is in use.";
"15002" = "This asset is under moderation";
"15003" = "You can't export a stock asset";
"16001" = "This group recording has ended";
"23000" = "Storage failed";
"23001" = "Failed to send e-mail";
"23002" = "Google oauth login failed";
"23003" = "Apple oauth login failed";
"23004" = "Video editing server error";
"23005" = "Upload in progress";
"23006" = "Failed to create sequence";
"expiration time not valid" = "The Expiration time is not valid";

//notification
"clipSharedWithMe" = "Clip Shared With Me";
"projectSharedWithMe" = "Project Shared With Me";
"folderSharedWithMe" = "Folder Shared With Me";
"newContentInFolder" = "New Content In Folder";
"newContentInProject" = "New Content In Project";
"commentOrReplyOnMyClip" = "Comment Or Reply On My Clip";
"replyToMyComment" = "Reply To My Comment";
"newClipToModerate" = "New Clip To Moderate";
"moderateMyClip" = "Moderate My Clip";
"newAssetToModerate" = "New Asset To Moderate";
"moderateMyAsset" = "Moderate My Asset";
"startGroupRecording" = "Start Group Recording";

"my projects" = "My Projects";
"projects shared with me" = "Projects Shared With Me";
"create new project" = "Create New Project";
"project rename" = "Project Rename";
"viewer: can view and export project assets" = "Viewer: Can view and export project assets";
"contributor: can add and export project assets (Sign-in required)" = "Contributor: Can add and export project assets (Sign-in required)";
"manager: can manage project assets, start group recording, and change sharing settings (Sign-in required)" = "Manager: Can manage project assets, start group recording, and change sharing settings (Sign-in required)";
"add project assets" = "Add Project Assets";
"join group recording" = "Join Group Recording";
"create video" = "Create Video";
"share project" = "Share Project";
"export project assets as shared folder" = "Export Project Assets as Shared Folder";
"all assets" = "All Assets";
"main story" = "Main Story";
"footages" = "Footages";
"intro" = "Intro";
"outro" = "Outro";
"background music" = "Background Music";
"uncategorized" = "Uncategorized";
"transcripts" = "Transcripts";
"mark as preferred" = "Mark as Preferred";
"mark as unwanted" = "Mark as Unwanted";
"preferred" = "Preferred";
"unwanted" = "Unwanted";
"none" = "None";
"remove mark" = "Remove Mark";
"edit limit hint" = "Cannot edit more than 40 characters at a time.";
"mark as" = "Mark as:";
"highlight to mark" = "Highlight to mark";
"finish editing" = "Finish Editing";
"preview selection" = "Preview Selection";
"mark segement tip" = "Move handles to mark preferred and unwanted segments of your video. Can mark multiple segments.";
"transcript edit hint" = "Please correct the word errors in your transcript and highlight text to mark your preferred and unwanted segments to help us better match your keywords. Any edits here will not affect the content of your original clip.";
"add project description..." = "Add project description...";
"untitled project" = "Untitled Project";
"import project assets" = "IMPORT PROJECT ASSETS";
"my media" = "My Media";
"stock" = "Stock";
"desktop" = "Desktop";
"downloads" = "Downloads";
"type of asset" = "Type of Asset";
"selected clips:" = "Selected Clips:";
"you can categorize these assets later." = "You can categorize these assets later.";
"import" = "Import";
"ongoing group recording" = "Ongoing Group Recording";
"export" = "Export";
"* the exported folder will be under \"My Library\".\n* It will be shared with everyone in the project.\n* If you imported clips shared to you, those clips will not be included in the folder." = "* The exported folder will be under \"My Library\".\n* It will be shared with everyone in the project.\n* If you imported clips shared to you, those clips will not be included in the folder.";
"export project as a shared folder" = "EXPORT PROJECT AS A SHARED FOLDER";
"all" = "All";
"video" = "Video";
"audio" = "Audio";
"image" = "Image";
"change order of main story clips" = "Change order of main story clips";
"approved" = "Approved";
"my own clips" = "My Own Clips";
"%d selected" = "%d Selected";
"ai create video descrition" = "Tell us more...What type of videos do you want to create? Our AI will be able to better cater to your needs.";
"create video description" = "This part will have the project description by default.";
"video length description" = "Estimated Maximum Video Length";
"create video!" = "Create Video!";
"back to project assets" = "Back to Project Assets";
"%d min" = "%d min";
"unlimited" = "Unlimited";
"ai process hint" = "We are working on generating your video!\n This will take several minutes.\n Once it’s ready, we will let you know via notification.";
"ai notification hint" = "AI-generated videos will be shown on this page.\n You can continue to edit them or export them directly.";
"created videos" = "Created videos";
"edit video hint" = "You can edit assets and annotations to create more videos.";
"export to my library" = "Export to My Library";
"continue editing" = "Continue Editing";
"resoultion hint" = "Resolution quality may be lower for preview purposes. Export to view in full resolution.";
"view created videos" = "View Created Videos";
"previously created videos" = "Previously created videos";
"project Assets will be shown here" = "Project Assets will be shown here";
"import from Visla or upload local files." = "Import from Visla or upload local files.";
"in order to create a video, you must have %1at least one Main Story asset%1. For now, we only support video assets with English audio as Main Story. \n\nMain Story assets make up the backbone of your video. We will extract the audio of these clips and match annotations from your Footage clips to enhance your story." = "In order to create a video, you must have %1at least one Main Story asset%1. For now, we only support video assets with English audio as Main Story. \n\nMain Story assets make up the backbone of your video. We will extract the audio of these clips and match annotations from your Footage clips to enhance your story.";
"in order to create a video, you must have %1at least one Footage asset%1.\n\nFootage assets are the fill-in clips used to generate visual dynamics for the video. They will be embedded throughout your Main Story based on your annotation. The audio of Footage assets will be muted." = "In order to create a video, you must have %1at least one Footage asset%1.\n\nFootage assets are the fill-in clips used to generate visual dynamics for the video. They will be embedded throughout your Main Story based on your annotation. The audio of Footage assets will be muted.";
"%1intro%1 asset will be played at the beginning/end of your video." = "%1Intro%1 asset will be played at the beginning/end of your video.";
"%1outro%1 asset will be played at the beginning/end of your video." = "%1Outro%1 asset will be played at the beginning/end of your video.";
"%1background Music%1 will be played throughout your video. The music volume will be adjusted accordingly based on your Main Story audio." = "%1Background Music%1 will be played throughout your video. The music volume will be adjusted accordingly based on your Main Story audio.";
"asset tag's place holder" = "Tags are essential for helping us better understand your asset.";
"asset description's place holder" = "Add description for this asset";

"undo" = "Undo";
"redo" = "Redo";
"preview" = "Preview";
"saving..." = "Saving...";
"style" = "STYLE";
"media" = "MEDIA";
"music" = "MUSIC";
"back to created video" = "Back to Created Videos";
"scene %d" = "Scene %d";
"%d s" = "%d s";
"all scenes" = "All Scenes";
"selected scenes" = "Selected Scenes";
"add video description..." = "Add video description...";
"changes applies to all scenes" = "Changes made here applies to all scenes.";
"header text" = "HEADER TEXT";
"body text" = "BODY TEXT";
"color" = "Color";
"font" = "Font";
"size" = "Size";
"scene background color" = "Scene Background Color";
"new scene" = "New Scene";
"back to editing video" = "Back to Editing Video";
"play from start" = "Play from Start";
"show colors..." = "Show Colors...";
"edit scene" = "Edit Scene";
"set scene time" = "Set Scene Time";
"edit mainstory" = "Edit Main Story";
"edit footage" = "Edit Footage";
"scene audio" = "Scene Audio";
"trim" = "Trim";
"cut" = "Cut";
"no footage hint" = "There are no footages for this scene. Drag clips from Media onto the Scene to add.";
"footage" = "Footage";
"Stock" = "STOCK";
"My Media" = "MY MEDIA";
"My Music" = "MY MUSIC";
"search my media" = "Search My Media";
"search my stock" = "Search My Stock";
"search my music" = "Search My Music";
"apply changes" = "Apply Changes";
"search" = "Search";
"no scene selected hint" = "Select a scene to switch back to editing mode.";
"main story tooltip" = "Main Story provides the basic structure for your video and is unadjustable on its own.";
"footage tooltip" = "Drag asset from Media to replace current footage or add footage if there is none. Asset’s audio will be muted.";
"date and time" = "Date and Time";
"timezone" = "Timezone";
"time format" = "Time Format";
"notifications" = "Notifications";
"allow notifications" = "Allow notifications";
"update settings" = "Update Settings";
"general" = "General";
"project" = "Project";
"adjust apecific notifications" = "Adjust Specific Notifications";
"new clip shared with me" = "New clip shared with me";
"comments or replies on my videos" = "Comments or replies on my videos";
"replies to my comments on others’ videos" = "Replies to my comments on others’ videos";
"new group-recording session" = "New group-recording session";
"new folder shared with me" = "New folder shared with me";
"new content in a folder that I own" = "New content in a folder that I own";
"new project shared with me" = "New project shared with me";
"new content in a project that I own" = "New content in a project that I own";
"new clip I need to moderate in a folder" = "New clip I need to moderate in a folder";
"when my clip is moderated in a folder" = "When my clip is moderated in a folder";
"new asset I need to moderate in a project" = "New asset I need to moderate in a project";
"when my asset is moderated in a project" = "When my asset is moderated in a project";
"when AI has finished generating video" = "When AI has finished generating video";
"default style" = "Default Style";
"default intro/outro" = "Default Intro/Outro";
"add intro" = "Add Intro";
"add outro" = "Add Outro";
"change intro" = "Change Intro";
"remove intro" = "Remove Intro";
"change outro" = "Change Outro";
"remove outro" = "Remove Outro";
"update user settings success" = "Update user settings success";
"visla cloud" = "Visla Cloud";
"set as intro" = "Set as Intro";
"set as outro" = "Set as Outro";
"has changes to save" = "You have unsaved changes on this page.";
"don't save" = "Don't Save";
"profile" = "Profile";
"feedback" = "Feedback";
"sign out" = "Sign Out";
"update profile" = "Update Profile";
"account" = "Account";
"change password" = "Change Password";
"first name" = "First Name";
"last name" = "Last Name";
"old password" = "Old Password";
"new password" = "New Password";
"confirm new password" = "Confirm New Password";
"password mismatch" = "The two passwords entered are not the same";
"password is not valid" = "Be a minimum of eight (8) characters in length.\nContain at least one (1) character from three (3) of the following categories:\n   1) Uppercase letter (A-Z)\n   2) Lowercase letter (a-z)\n   3) Digit (0-9)\n   4) Special character (~!@#$%^&*()_-+={}[]|:;<>,./?)";
"edit" = "Edit";
"change picture" = "Change Picture";
"change profile picture" = "Change Profile Picture";
"adjust main story segment" = "Adjust the segment of Main Story you want to use.";
"adjust footage segment" = "Adjust the segment of Footage you want to use. Your segment cannot be longer than this scene’s Main Story.";
"add main story" = "Add Main Story";
"add footage" = "Add Footage";
"replace footage" = "Replace Footage";
"what would you like to tell us about?" = "What would you like to tell us about?";
"device type" = "Device Type";
"please tell us your feedback." = "Please tell us your feedback.";
"display email" = "Display Email";
"thank you for giving us your feedback!" = "Thank you for giving us your feedback!";
"submit feedback" = "Submit Feedback";
"something that I like" = "Something that I like";
"something that I do not like" = "Something that I do not like";
"suggest an improvement" = "Suggest an improvement";
"suggest a new idea" = "Suggest a new idea";
"general comments" = "General comments";
"mac" = "Mac";
"default style hint" = "This will be used as the default style for your project videos.";
"default intro outro hint" = "These clips will be automatically imported into your projects as “Intro” and “Outro”.";
"thumbnail not yet available" = "Thumbnail not yet available";
"are you sure you want to replace the current intro?" = "Are you sure you want to replace the current intro?";
"replace intro" = "Replace Intro";
"replace outro" = "Replace Outro";
"rename scene" = "Rename Scene";
"click to edit header text" = "Click to edit header text";
"click to edit body text" = "Click to edit body text";
"input an non-empty title" = "Please input an non-empty title";
"go to current scene" = "Go to Current Scene";
"home search place holder" = "Search Clips, Folders, Projects, and Contacts";
"visla" = "Visla";
